---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSet.Contains(Autodesk.Revit.DB.Electrical.InsulationType)
source: html/502f2bf8-c89a-84a7-10b1-dc7682b93bcb.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.Contains Method

Tests for the existence of a insulation type within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	InsulationType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.InsulationType`) - The insulation type to be searched for.

## Returns
The Contains method returns True if the insulation type is within the set, otherwise False.